{"id":296,"date":"2018-12-08T22:01:53","date_gmt":"2018-12-08T15:01:53","guid":{"rendered":"https:\/\/xotours.vn\/?page_id=296"},"modified":"2024-11-25T09:58:23","modified_gmt":"2024-11-25T02:58:23","slug":"faq","status":"publish","type":"page","link":"https:\/\/xotours.vn\/faq.html","title":{"rendered":"FAQ"},"content":{"rendered":"<p>[vc_row][vc_column][vc_column_text el_class=&#8221;page_title&#8221;]<\/p>\n<h1>Ho Chi Minh City (Saigon) FAQ<\/h1>\n<p>[\/vc_column_text][vc_separator el_width=&#8221;10&#8243;][\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text el_class=&#8221;margin_bottom_0&#8243;]<div style=\"height: 48px;\" class=\"gap-gap responsive\"><\/div>[\/vc_column_text][\/vc_column][\/vc_row][vc_row el_class=&#8221;max_width_1300 margin_left_auto margin_right_auto&#8221;][vc_column][vc_accordion active_tab=&#8221;false&#8221; collapsible=&#8221;yes&#8221; title_size=&#8221;h4&#8243; style=&#8221;3&#8243;][vc_accordion_tab title=&#8221;What does XO stand for?&#8221;][vc_column_text]X.O. is short for &#8220;xe om&#8221;, which are motorbike taxis in Vietnam. Our xe oms are very unique however because all our drivers are women who wear beautiful Vietnamese dresses and can speak fluent English!<\/p>\n<p>Here is a link to a fun Youtube video explaining &#8220;What is XO&#8221;? &#8211; <a title=\"View the video\" href=\"https:\/\/www.youtube.com\/watch?v=-BY9B6jnpP8\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https:\/\/www.youtube.com\/watch?v=-BY9B6jnpP8<\/a>[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Do you offer your tours in any other city in Vietnam besides Ho Chi Minh City?&#8221;][vc_column_text]No. We currently only offer our tours in Ho Chi Minh City. There are many unreputable tour companies that have tried to make a quick profit by using our name and reputation however, so please beware of these copycats. These tour companies are very poorly managed and are not safe in our opinion. If you are not booking a tour with us through &#8220;xotours.vn&#8221; then you are not going with the real XO Tours.[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Do you offer your tours in any other language other than English?&#8221;][vc_column_text]All our tours are by default offered in ENGLISH however we also provide an option to book a Chinese (Mandarin) OR Korean translator on our evening tours (for an additional fee) if you book for a minimum of 4 pax or you book a Private tour (minimum 2 pax). We require 24 hours notice to arrange a Chinese or Korean Translator.<\/p>\n<p><a href=\"https:\/\/www.instagram.com\/reel\/C-UcFuIv6CB\/\" target=\"_blank\" rel=\"noopener\">https:\/\/www.instagram.com\/reel\/C-UcFuIv6CB\/<\/a>[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Can I book your tours on Viator, Tripadvisor, GetYourGuide, Klook or other online travel agents (OTAs)?&#8221;][vc_column_text]NO. Our tours are exclusive and cannot be booked on any other other website. If you see a tour purporting to be offered by XO sold on another website, it is 100% a low quality copycat tour trying to profit from our reputation and the tour they offer WILL NOT provide a similar experience.  There are currently hundreds of motorbike tours in Vietnam but there is no single other tour operator that has achieved the acclaim that XO Tours has over the past 14 years.[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;How is XO Tours different from other Vietnam tour operators?&#8221;][vc_column_text]XO Tours was the first motorbike tour company in Vietnam to hire female tour guides; because we feel that the hard working Vietnamese women offer a unique perspective to life in Vietnam. Due to our success, many young women in Vietnam have been provided more opportunities to work in the fast growing tourism industry. XO Tours is also the most <a title=\"Read this article\" href=\"http:\/\/xotours.vn\/blog\/2015\/01\/22\/xo-tours-in-hanoi\/\" target=\"_blank\" rel=\"noopener noreferrer\">copied tour<\/a> in Vietnam with no less than 200 other tour companies mimicking our concept. The main problem with this is that the copycat tours only copy the idea of our tours and not the high standards XO is known for.<\/p>\n<p>Due to the rise in the popularity of motorbike tours in Vietnam, there are many new companies offering cheap tours that may seem like a great bargain but they cut a lot of corners. ALL the cheap tours operate illegally, they serve low quality street food full of carbs to fill you up, they hire students and pay them peanuts which seriously affects the quality and safety of your experience.<strong> The difference between our tours and the cheap copycats is like NIGHT and DAY. It is IMPOSSIBLE to provide the superior tour experience that XO offers at a low price.<\/strong><\/p>\n<p><strong>1.<\/strong>  <strong><span style=\"color: #ff0000;\">XO Tours is 100% legal.<\/span> <\/strong>The majority of tour companies in Vietnam operate illegally. All tour operators are required by law to be licensed by VNAT (Vietnam National Administration of Tourism), and have tour guides with international tour guide licenses. Over 90% of the tour operators in Vietnam are not licensed however, because it is much more expensive to operate legally; legal tour operators must have an office, pay taxes, and provide insurance for both staff and customers.<strong> If the tour company that you book with is unlicensed and\/or guided by students, most travel insurance policies will not cover you if you get injured in an accident. Read this blog post to learn how to verify if your tour operator is licensed and legal: <\/strong><a href=\"https:\/\/xotours.vn\/blog\/things-you-should-know-before-booking-a-tour-in-vietnam\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https:\/\/xotours.vn\/blog\/things-you-should-know-before-booking-a-tour-in-vietnam\/<\/a><\/p>\n<p><strong>2.<span style=\"color: #ff0000;\"> We provide accident insurance<\/span><\/strong> <span style=\"color: #ff0000;\"><strong>and hire support and security staff to ensure your safety.<\/strong> <\/span>The majority cheap tour operators do not provide or will lie about offering accident insurance. Please ask them to provide a copy of their accident insurance policy if you want to be certain. Every guest that books with XO Tours is covered by <span class=\"_4yxo\"><strong>$10,000 USD in NO-FAULT insurance<\/strong>,<\/span> which means that (in case of an accident) we can take you to the best international hospitals or clinics in Vietnam without having to receive preapproval, and there is no risk that you will have to prepay for any medical expenses and then wait to be reimbursed. To learn more about this feature click <a title=\"XO Accident Insurance\" href=\"\/?page_id=492\" target=\"_blank\" rel=\"noopener noreferrer\">HERE<\/a>.<\/p>\n<p><strong>3.<\/strong> <strong><span style=\"color: #ff0000;\">At XO Tours we are staffed by professional, licensed tour guides, NOT STUDENTS.<\/span><\/strong> Being a local does not automatically qualify someone or provide them with the requisite skills to be a great tour guide, just as your next door neighbor in your own country probably wouldn&#8217;t make a great tour guide. In our opinion, great tour guides are borne from professional training and experience. Each of our guides must go through a rigorous interview and training course in order to work for XO Tours. We hire only the best and brightest! Young women who have real passion for their work and love for Vietnam. Our employees only work for XO Tours (no freelance guides!) and are trained to offer the safest possible ride. Because your safety and satisfaction are our paramount concern, we will not compromise on the quality of our staff just to save a few dollars.<\/p>\n<p><strong>4.<\/strong> <span style=\"color: #ff0000;\"><strong>Our tours are exclusive.<\/strong><\/span> Most Vietnam tour operators offer their tours for sale on every single online booking platform (Tripadvisor, Viator, Booking.com, AirBNB Experiences, Get Your Guide, Klook, etc.), through hotels and tour operators, paying tons of commissions for booking referrals.<strong> At XO Tours, the only way to book our tours is through our <a href=\"https:\/\/xotours.vn\">website<\/a> or to contact us directly.<\/strong> We do not want to dilute the quality of our tours by trying to cater to every single type of traveler.<\/p>\n<p>While we are not the lowest priced tour, nor the most expensive,  we’re sure that you won’t find another motorbike tour that offers a better value than XO Tours. We have better drivers, professionally trained tour guides, newer motorbikes, higher quality helmets, a security and support team following every tour, accident insurance and the most caring and fun-loving employees in the world! We may not be the cheapest, but we offer you more for your dollar than any other motorbike tour in Vietnam![\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Are there any reasons I shouldn&#8217;t book with XO?&#8221;][vc_column_text]Although we are very proud of the <a href=\"https:\/\/xotours.vn\/press.html\">acclaim our tours have received<\/a> over the years, we realize that they are not suitable for everyone. These are the 3 main reasons we think some guests should<strong> NOT<\/strong> book our tours:<\/p>\n<p><strong>1. If you are looking for a typical food tour <\/strong><\/p>\n<p>All the dishes and stops on the &#8220;XO Foodie&#8221; tour are carefully curated to offer you the most unique experience possible. Unlike other food tours in Vietnam, we are not looking to serve you common Vietnamese dishes that you can find on every street corner, <strong>even if that means taking the risk that you won&#8217;t like every single dish<\/strong>. On the &#8220;XO Foodie Tour&#8221; we want you to eat the exact same dishes that our staff love to eat when they are not working, so those are the types of dishes we offer on the tours. Our goal is to also show you the huge contrast between the different districts so we can give you a feel for what life is truly like for the Saigonese people.<\/p>\n<p>If you’re just looking for a food tour that jumps from one food stop to the next however, and you don’t care to venture outside the touristy districts in Saigon to see a side of the city that none of the other tours go to, then XO Tours is probably not the tour for you.<\/p>\n<p><strong>2. If you are not interested in Vietnamese history<\/strong><\/p>\n<p>On our<a href=\"\/?page_id=11\"> “Sights of Saigon” tour<\/a>, not only will we provide some interesting historical background for each location we take you to, we will also share unique local insights that you won’t find in most guidebooks. Rather than just throwing facts at you, we try to connect each place to a human event, so that you will remember each location for the impact it had on the Vietnamese people. We are proud of our history and we are looking to share it with people that desire more than a skin deep understanding of the places they&#8217;ve seen on tv or read about.  If you find history boring however, then you probably shouldn’t book this tour.<\/p>\n<p><strong>3.<\/strong> <strong>If you want the cheapest motorbike tour <\/strong><\/p>\n<p style=\"text-align: left;\">At XO Tours we want to provide you with a boutique experience that you cannot find anywhere else, combined with the best customer service in Vietnam. We hire the best possible staff and train them to be great ambassadors for Vietnam. We believe the time, effort and attention to detail we put into creating our tours is reflected in the high quality of the tours.<\/p>\n<p>The majority of other motorbike tours operate illegally, serve the cheapest possible food, and hire poorly trained student guides which allows them to run their tours with practically no overhead costs.<\/p>\n<p style=\"text-align: left;\">We believe that majority of travelers are willing to pay a little more for a superior experience and can recognize the value that XO Tours offers. For guests that just want to drive around on a motorbike for the lowest possible price, there are many other options in Saigon to chose from.<\/p>\n<p>If you are like the majority of the 100,000 + guests that have gone on our tours however, we think you will love your time with us![\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Do I drive my own motorbike on the tour?&#8221;][vc_column_text]No. All of our guests ride pillion behind one of our driver\/tour guides. Our liability insurance does not permit a guest to drive themselves.<\/p>\n<p>Riding pillion is a great way to relax and to safely see the city. All our female guides are fully licensed and have terrific driving records![\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Is it safe to ride a motorbike in Vietnam?&#8221;][vc_column_text]Driving a motorbike in Vietnam is not as dangerous as it looks. The driving speeds in the city are pretty low and most motorbike drivers are very good at avoiding each other.<\/p>\n<p>The most important quality we look for when we hire our employees is driving ability, so all our XO Girls are very safe drivers with excellent driving records.<\/p>\n<p>Click on the video link below to see some older guests safely enjoying their time on our tours:<\/p>\n<p><a href=\"https:\/\/www.instagram.com\/p\/C5aT03yvw05\/\" target=\"_blank\" rel=\"noopener\">https:\/\/www.instagram.com\/p\/C5aT03yvw05\/<\/a>[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Do you offer a car option if I don&#8217;t want to go by motorbike?&#8221;][vc_column_text]Yes, we offer a car\/bus option if you book a private tour (minimum of 2 adults).  There is a $60 USD surcharge to book a car for 2-4 people and an additional $5 USD per person for groups over 4 people ($60 for 4 pax, $65 for 5 pax, $70 for 6 pax, etc.). The surcharge is to cover the cost of the car\/bus rental (with driver). Please keep in mind that the car\/bus option is only available for private tours, and we cannot mix different transport methods (car + motorbikes), so everyone in the same group will have to use the same transport option. We also require at least 24 hours notice if you wish to join one of our tours by car\/bus.<\/p>\n<p>We do not offer a car\/bus option for the group tours since traveling by car\/bus is much slower than by motorbike and out of consideration for our other guests we cannot delay the tour for any single party.[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Can you accommodate Vegans and Vegetarians on your tours?&#8221;][vc_column_text]Absolutely! We take vegans and vegetarians on our tours almost daily, and prior guests love the variety and quality of the dishes we provide!<\/p>\n<p>Our vegan and vegetarian guests will be provided just as much food or more than other guests on the tour.<\/p>\n<p>For a glimpse as the type of dishes we offer to vegan\/vegetarian guests on the &#8220;XO Foodie Tour&#8221; click on the video link below:<\/p>\n<p><a href=\"https:\/\/www.instagram.com\/reel\/C-9pEijPwWR\/?igsh=bWUxZzhjN214Z2ty\">https:\/\/www.instagram.com\/reel\/C-9pEijPwWR\/?igsh=bWUxZzhjN214Z2ty<\/a><\/p>\n<p>Please keep in mind that our tours are by default group tours so non-vegan\/vegetarian guests will be served dishes containing meat.[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Can you cater to my food allergies and other restrictions?&#8221;][vc_column_text]If given prior notice, we can adjust the dishes on our tours to accommodate almost any food restriction. Don&#8217;t like seafood &#8211; no problem. Vegetarians\/Vegans we&#8217;ve also got you covered. We can also deal with gluten allergies, nut allergies, shellfish allergies, etc.<\/p>\n<p>Please let us know about your food restrictions, at the time you book your tour, so that we can prepare alternative options.<\/p>\n<p>If you are allergic to fish however, we do not recommend booking our food tour as most dishes in Vietnam are marinated with generous amounts of fish sauce. If you&#8217;re allergic to fish sauce then the only safe dishes for you to eat are the vegetarian dishes.<\/p>\n<p>We also don&#8217;t recommend booking a tour if you are allergic to MSG, as most Vietnamese dishes will contain MSG (including vegetarian dishes).<\/p>\n<p>Click on the video link below to see how XO ensures guests with food allergies don&#8217;t get sick on our tours!<\/p>\n<p><a href=\"https:\/\/www.instagram.com\/p\/C7V6FPcPp64\/\" target=\"_blank\" rel=\"noopener\">https:\/\/www.instagram.com\/p\/C7V6FPcPp64\/<\/a><\/p>\n<p>For more information about navigating Vietnam with food allergies (such as gluten sensitivity), please <a href=\"https:\/\/xotours.vn\/blog\/eating-gluten-free-and-other-food-allergies-in-vietnam\/\">read our article<\/a> on the topic.[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Are your tours kid friendly?&#8221;][vc_column_text]Yes! We design our tours to be suitable for guests of all ages, and take children on our tours regularly. Parents trust XO Tours to offer the safest possible experience for their children because our drivers are the best in the business! We are also the first motorbike tour company to provide accident insurance for all our guests!<\/p>\n<p>Children 7 years and younger are allowed to share a single motorbike with one of our drivers and another adult. Children 8 years and older must sit on a separate motorbike with their own driver as required by Vietnamese law.<\/p>\n<p>We only charge $30 for children sharing a motorbike however, children 8 years and older are charged the same rate as other guests.<\/p>\n<p>We love children and they love XO tours! Watch this video to see how much fun kids have on our tours! &#8211; <a title=\"children having fun with XO Tours\" href=\"https:\/\/www.youtube.com\/watch?v=5N9mYKy1xcU\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https:\/\/www.youtube.com\/watch?v=5N9mYKy1xcU<\/a>[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;I am larger than the average Vietnamese person; can your drivers carry me?&#8221;][vc_column_text]Yes, absolutely! Our girls are placed through a rigorous driving test before they are hired to ensure they are confident and capable of carrying foreigners on their motorbike.<\/p>\n<p>Our cutoff weight is around 130 kg or 280 lbs.<\/p>\n<p>Click on the video link below to see a fun video of large and tall guests on our tours:<\/p>\n<p><a href=\"https:\/\/www.instagram.com\/p\/C6IpC5jPgsL\/\" target=\"_blank\" rel=\"noopener\">https:\/\/www.instagram.com\/p\/C6IpC5jPgsL\/<\/a><\/p>\n<p>And the following video shows how we test our guides to see if they are capable of carrying heavier guests:<\/p>\n<p><a href=\"https:\/\/www.instagram.com\/p\/C4uhGMPPrPa\/\" target=\"_blank\" rel=\"noopener\">https:\/\/www.instagram.com\/p\/C4uhGMPPrPa\/<\/a>[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;What happens if it rains before\/during our tour?&#8221;][vc_column_text]We run our tours in rain or shine. If it is raining heavily before the start of your tour however, we will delay the start time by 30 minutes<span style=\"color: #ff6600;\"><strong> [one of our employees will meet you at your hotel and update you on the tour status. If you are not staying at a hotel, then please call us at 09 3308 3727]<\/strong><\/span>.<\/p>\n<p>If we feel that the road conditions are safe, then we will continue the tour as planned. We provide free high quality rain ponchos for all our guests.<\/p>\n<p>If it starts to rain heavily during the tour and we have to cancel, then we will flag down a taxi to get you back to your hotel safely. You will only be charged for the time you spent on the tour.<\/p>\n<p>Luckily, the rain showers in Ho Chi Minh City are usually short lived, so they haven&#8217;t affected our tours much in the past. During the rainy season (June-November) you should expect that it will rain everyday (usually in the afternoons). Most of our guests really enjoy their tour experience even in the rain however. Rest assured that the XO ladies are expert drivers, and we will only continue with our tours if we feel that it is absolutely safe to do so.<\/p>\n<p><span style=\"color: #ff0000;\"><strong>If you do not want to go on a tour in rainy conditions, we would recommend not booking a motorbike tour in Vietnam. Our standard cancellation policy will apply for any last minute cancellations under these circumstances. <\/strong><\/span><\/p>\n<p>Click on the video link below to see how XO manages tours during the 6 month rainy season:<\/p>\n<p><a href=\"https:\/\/www.instagram.com\/p\/CxmxBnmvgAM\/\" target=\"_blank\" rel=\"noopener\">https:\/\/www.instagram.com\/p\/CxmxBnmvgAM\/<\/a>[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Do you offer pickup\/drop-off service at my hotel\/apartment\/condo or the airport?&#8221;][vc_column_text]We only offer pickup service in Districts 1, 3, 4 and 5 (some exclusions apply). For guests staying outside of our pickup area, we kindly request that you meet us at the Saigon Opera House in District 1 for the start of your tour(s).<\/p>\n<p>We also do not currently offer airport pickup\/drop-off service.[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;What is the difference between the &#8220;Saigon by Night&#8220; and &#8220;XO Foodie Tour?&#8220;&#8221;][vc_column_text]The &#8220;XO Foodie Tour&#8221; as you can tell by the name is a food tour. On this tour you will get to try 10-12 unique dishes that most other tours in Vietnam do not offer. We also include a couple of unique sightseeing stops on the tour.<\/p>\n<p>And although you do get dinner and dessert on the &#8220;Saigon by Night&#8221; tour, it is NOT A FOOD TOUR. This tour focuses on Vietnamese culture. The highlight of the &#8220;Saigon by Night&#8221; tour is an opportunity to visit a local home, which will give you a better understanding of how the locals live, work and eat.<\/p>\n<p>The itineraries for both the &#8220;XO Foodie&#8221; and &#8220;Saigon by Night&#8221; tours are unique and do not overlap.[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Your Saigon By Night and XO Foodie Tour include street food. Is it safe to eat?&#8221;][vc_column_text]As with food in any country, we cannot guarantee that you won&#8217;t get sick while <a title=\"street food in Vietnam\" href=\"https:\/\/xotours.vn\/blog\/street-food-culture-in-saigon\/\">eating street food in Vietnam<\/a>, but we do not believe that the risk is any greater than eating at a restaurant. At least with street food you can see how the food is prepared in front of you, whereas in a restaurant you never know the sanitary conditions in the back kitchen.<\/p>\n<p>At XO Tours, we choose our food venues very carefully and make sure that they adhere to strict sanitary standards. Gratefully, very very few of our guests have ever told us they have had any ill affects after going on our tours. Which is amazing since we offer <a href=\"\/?page_id=13\">all you can eat and drink on our Foodie tours<\/a>![\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;What is the maximum group size for your tours?&#8221;][vc_column_text]Our group sizes varies depending on the tour:<\/p>\n<p>1. The maximum group size for the &#8220;Sights of Saigon&#8221; tour is 8 people<\/p>\n<p>2. The maximum group size for the &#8220;Saigon by Night&#8221; tour is 8 people<\/p>\n<p>3. The maximum group size for the &#8220;XO Foodie&#8221; tour is 16 people<\/p>\n<p>**** We do make exceptions for single large parties or corporate (MICE) groups, so please contact us if you want to book a group larger than the sizes listed above. ****[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;What is your cancellation policy?&#8221; el_id=&#8221;cancellation_policy&#8221;][vc_column_text]<strong>For bookings between 1-10 people:<\/strong><\/p>\n<p>There is no penalty for cancelling your tour if you provide us with at least 5 days notice. Cancellations made between 1 to 4 days of your tour date will be charged a 20% cancellation fee. If you cancel on the day of your tour, there will be a 50% late cancellation charge.<\/p>\n<p><strong>For groups larger than 10 people:<\/strong><\/p>\n<p>There is no penalty for cancelling your tour if you provide us with at least 2 weeks notice. Cancellations made between 8-13 days of your tour date will be charged a 20% cancellation fee. There will be a 50% late cancellation charge for any cancellations made within 7 days of the tour date.<\/p>\n<p><strong><span style=\"color: #ff0000;\">No shows on the day of the tour due to flight delays, flight cancellations, or late arrival from other tours will also incur a 50% late cancellation charge.<\/span><\/strong><\/p>\n<p><strong><span style=\"color: #ff0000;\">If we cancel a tour due to bad weather, and you have already paid for the tour in full or placed a tour deposit; we will refund you your payment in full.<\/span><\/strong><\/p>\n<p><span style=\"color: #0000ff;\"><strong>ATTENTION: Please note that Paypal is changing their refund policy as of October 11th, 2019. The new policy states that Paypal will now keep the full transaction fee they charge a business, even if the original transaction is later cancelled and refunded by the business. That means that starting on October 11th, 2019 any refunds to guests that pay via Paypal  will be the total amount paid minus the transaction fee (up to 4.5% in Vietnam). If you want to learn more about Paypal’s new refund policy, please read the following article from The Verge:<\/strong><\/span><\/p>\n<p><a href=\"https:\/\/www.theverge.com\/2019\/9\/20\/20876570\/paypal-refund-fee-policy-change-sellers-controversy\" target=\"_blank\" rel=\"noopener noreferrer\">https:\/\/www.theverge.com\/2019\/9\/20\/20876570\/paypal-refund-fee-policy-change-sellers-controversy<\/a><\/p>\n<p><span style=\"color: #0000ff;\"><strong>Please keep in mind that the 2.9% fee mentioned in the article applies only to to Paypal accounts based in the United States. The transaction fees Paypal charges in other countries like Vietnam varies and can go up to 4.5%. <\/strong><strong>Additionally, any Paypal refunds made 6 months after a payment will also incur a $4.99 service charge because Paypal does not allow us to issue refunds directly to a payment beyond that time, which means we have to refund via the “Send Money” function which incurs a $4.99 service charge.<\/strong><\/span>[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Why are all your drivers female? Aren&#8217;t men stronger and better drivers?&#8221;][vc_column_text]We won&#8217;t argue that our female drivers are stronger than men, however it is our opinion that Vietnamese women are much more cautious, safe, and conscientious drivers in comparison to the Vietnamese men. They generally drive slower, don&#8217;t swerve in and out of traffic nor run red lights as often as you see the men do. <a href=\"https:\/\/saigoneer.com\/vietnam-news\/14849-male-drivers-are-responsible-for-98-61-of-accidents-from-2013-to-2017-report?fbclid=IwAR3LvixHWC1HyK3sm_AVCw-z9m7Dem3SGVpIl8BPm6yQTMHmpkaYxLUw7bs\" target=\"_blank\" rel=\"noopener noreferrer\">Over 90% of the motorbike accidents we&#8217;ve seen involve men<\/a>, not women.<\/p>\n<p>Click on the video link below to watch a fun video of the XO Girls carrying big and tall guests on our tours:<\/p>\n<p><a href=\"https:\/\/www.instagram.com\/p\/C6IpC5jPgsL\/\" target=\"_blank\" rel=\"noopener\">https:\/\/www.instagram.com\/p\/C6IpC5jPgsL\/<\/a><\/p>\n<p>And the video below shows how we test our guides to see if they can carry heavier guests:<\/p>\n<p><a href=\"https:\/\/www.instagram.com\/p\/C4uhGMPPrPa\/\" target=\"_blank\" rel=\"noopener\">https:\/\/www.instagram.com\/p\/C4uhGMPPrPa\/<\/a>[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;What kind of motorbikes do you use on your tours?&#8221;][vc_column_text]All our motorbikes are late model Honda and Yamaha scooters. The engines are rated at 125cc or below, so all major travel insurance policies should cover you if you ride as a pillion passenger.[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Is there anything I should not wear or bring when I go on a tour?&#8221;][vc_column_text]You should wear comfortable clothes because Saigon is usually hot, however women shouldn&#8217;t wear skirts or dresses. As a precaution, please leave necklaces, dangly earrings and other easily stolen jewelry at your hotel. It&#8217;s also recommended that you not use your camera while riding on the motorbike. If you want to take some photos, our guides will be happy to pull over so you can safely take pictures.[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Are the stops the same on your day and night tours?&#8221;][vc_column_text]Not at all. Our day and night tours offer completely different experiences. The Sights of Saigon tour mainly takes place in District 1 and 3 where most of the popular tourist attractions are located. Our XO Foodie Tours takes you to 5 other districts that most tourists don&#8217;t often get a chance to see, while the &#8220;XO Saigon by Night Tour&#8221; covers 4 Districts! Both our evening tours also offers our guests a chance to try out some delicious Saigon street food!<\/p>\n<p>For a comprehensive overview of Ho Chi Minh City, we recommend booking both the &#8220;Sights of Saigon&#8221; + &#8220;XO Foodie&#8221; Tour OR the &#8220;Sights of Saigon&#8221; + &#8220;Saigon by Night&#8221; Tour[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;What payment methods do you accept?&#8221;][vc_column_text]We currently only accept cash payment in either Vietnamese Dong or US Dollars on the day of the tour. If you you want to prepay for your tour(s) by credit card and you didn&#8217;t choose the online payment option at the time of booking, you can request a Paypal invoice from us. Payment using this method can only be accepted if payment is received at least 1 day before your tour date.<\/p>\n<p>If you choose to pay in cash, please make sure that your bills are in good condition, without any tears or markings on them. It is very difficult to exchange bills in Vietnam unless they are in near perfect condition.<\/p>\n<p>Currently we use the conversion rate of 1 US Dollar = 25,200 Vietnamese Dong, which is lower than the official rate, and makes it less expensive for our guests to pay in Vietnamese Dong. Here are the current prices (per person) for all our tours in both US Dollars and Vietnamese Dong.<\/p>\n<ol>\n<li>The Sights of Saigon &#8211; $58 or 1,461,600 VND<\/li>\n<li>Saigon By Night &#8211; $58 or 1,461,600 VND<\/li>\n<li>The XO Foodie &#8211; $82 or 2,066,400 VND<\/li>\n<\/ol>\n<p>[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;How far ahead of time do I need to book a tour?&#8221;][vc_column_text]Although we welcome last minute bookings (subject to availability), we recommend that you book your tour(s) at least 2 weeks ahead of your desired tour date as our tours often fill up quickly.<\/p>\n<p>For last minute bookings please email or call us at <a href=\"tel:+84%2093308 3727\">+84 93308 3727<\/a> to check on availability.<\/p>\n<p>If you are booking the &#8220;Sights of Saigon&#8221; tour, the booking cutoff time is 9pm the night before the tour date.<\/p>\n<p>If you are booking our &#8220;Saigon by Night&#8221; or &#8220;The XO Foodie&#8221; tour, the booking cutoff time is 3pm on the day of the tour.[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Do I need to put down a deposit\/prepay to book a tour?&#8221;][vc_column_text]Parties of 4 people or less that have a <strong>confirmed hotel reservation<\/strong>, do not have to put down a deposit to book a tour.<\/p>\n<p>For groups of 5 guests and up, private tours, guests that book the video option, and guests that are not staying at a hotel, we require a 20% deposit in order to reserve a booking. We also require a 20% deposit if you are booking a tour for another party, but not joining yourself.<\/p>\n<p><span style=\"color: #ff0000;\">**** If you break up a larger group in order to avoid paying the deposit, we will not be able to guarantee that everyone in your party will be put in the same tour group. Thank you for understanding. ****<\/span>[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;I am a solo traveler. Can I still book your tours?&#8221; el_id=&#8221;solo&#8221;][vc_column_text]We welcome bookings for solo travelers on all our tours except for private tours which require a minimum of 2 people to book. Please keep in mind that our regular tours are offered on a &#8220;join-in basis&#8221; so there will usually be multiple guests going together on any given tour.<\/p>\n<p>We love solo travel ourselves and wrote a brief safety guide for fellow solo travelers to Vietnam on our blog, <a title=\"safety tips for solo travelers in Vietnam\" href=\"https:\/\/xotours.vn\/blog\/solo-female-traveling-vietnam\/\">check it out<\/a> for more info.[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;I am arriving by cruise ship. Can you pick me up at the port?&#8221;][vc_column_text]The only ship port that we offer pickup\/drop-off service at is Nha Rong Port in District 4. If your ship docks at any other port, then we kindly request that you meet us in District 1 for the start of your tour(s).<\/p>\n<p>Many of the larger cruise ships dock at Phu My Port, which is located about 2 hours away from Ho Chi Minh City. Your cruise ship should be able to offer you various transport options into Ho Chi Minh City.[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;I emailed you\/booked a tour over 24 hrs ago. Why did I not receive a reply?&#8221;][vc_column_text]We reply to all emails and booking requests within 10 hours. Our emails are often mistakenly reported as SPAM however, so if you have not heard back from us within 24 hours, please check your SPAM folder before sending us another email.[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;What is the video option?&#8221;][vc_column_text]Want to be the star of your own personal music video? We can make it happen! Our video option is a great way to capture your adventure in Vietnam with XO Tours! We film your tours and then create a fun 8 minute video with music of your choosing.<\/p>\n<p>Two of our employees will follow behind you on a separate motorbike and film your entire tour. We will then choose the best parts from the video and then edit it with some fun music and effects. We will email you a link to download your video (in about 2 weeks) once it&#8217;s done.<\/p>\n<p>Our video editor is the best in the business! We spend a lot time to professionally edit your video and make sure it&#8217;s something you would be proud to show your friends and family. Check out our Gallery to see pictures and videos from our tours!<\/p>\n<p>You only need to book 1 video per party. Please also note that we only offer 2 videos per day, and once they are booked, the option will no longer be available.<\/p>\n<p>Click on the link below to see how your tour will be filmed!<\/p>\n<p><a href=\"https:\/\/www.instagram.com\/p\/C5fcQYbPXZo\/\" target=\"_blank\" rel=\"noopener\">https:\/\/www.instagram.com\/p\/C5fcQYbPXZo\/<\/a>[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Why do your guides wear Ao Dai?&#8221;][vc_column_text]The Ao Dai is a beautiful dress unique to Vietnam.  When many people think of Vietnamese women, the image of the elegant Ao Dai often comes to mind.  This traditional dress is just another small way we hope to share the beauty of Vietnamese culture with our guests.[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Can you tell me more about XO Accident Insurance?&#8221;][vc_column_text]Although all our drivers are extremely safe and well trained, we realize that sometimes accidents do happen that&#8217;s why we include XO Accident Insurance when you book any of our tours. Every guest that books with XO is covered by $10,000 USD in NO-FAULT insurance, which means that (in case of an accident) we can take you to the best international hospitals or clinics in Vietnam without having to receive preapproval, and there is no risk that you will have to prepay for any medical expenses and then wait to be reimbursed. To learn more about our exclusive &#8220;XO Accident Insurance&#8221; policy, what it covers and what it doesn&#8217;t, please click <a title=\"XO Tours Accident Insurance\" href=\"\/?page_id=492\" target=\"_blank\" rel=\"noopener noreferrer\">HERE<\/a>.[\/vc_column_text][\/vc_accordion_tab][vc_accordion_tab title=&#8221;Do I need a Visa to enter Vietnam?&#8221;][vc_column_text]Many travelers come to Vietnam not knowing they need a Visa and are then denied entry at the airport, which can be extremely stressful and end up costing a lot of money. So let us give you some tips to avoid this!<\/p>\n<div><\/div>\n<p>Let us start off by saying that <strong>MOST TRAVELERS WILL NEED A VISA TO ENTER VIETNAM.<\/strong> There are only 25 countries that have a Visa Exemption agreement with Vietnam that allows them to enter the country without obtaining a visa first, but the duration of the exemption for many of these countries is only 45 days, so if someone from one of these countries wants to stay for longer than 45 days, they should apply for a regular E-Visa which will allow them to stay in Vietnam for up to 90 days. To see if your country is on the list of 25 countries with a Visa exemption, please click on the following link:<\/p>\n<div class=\"x1e56ztr\"><\/div>\n<p class=\"x1e56ztr\"><span class=\"x193iq5w xeuugli x13faqbe x1vvkbs x1xmvt09 x6prxxf xvq8zen xo1l8bm xzsf02u\"><a class=\"x1i10hfl xjbqb8w x6umtig x1b1mbwd xaqea5y xav7gou x9f619 x1ypdohk xt0psk2 xe8uvvx xdj266r x11i5rnm xat24cr x1mh8g0r xexx8yu x4uap5 x18d9i69 xkhd6sd x16tdsg8 x1hl2dhg xggy1nq x1a2a7pz xt0b8zv x1fey0fg\" tabindex=\"0\" role=\"link\" href=\"https:\/\/www.myvietnamvisa.com\/vietnam-visa-exemption.html?fbclid=IwAR2r5sYCugGrVbSjQa-P0HBz0nk0krK3Q5nWAcurjCK_0e53yvK22zQZNW8\" target=\"_blank\" rel=\"nofollow noopener\">https:\/\/www.myvietnamvisa.com\/vietnam-visa-exemption.html<\/a><\/span><\/p>\n<div class=\"x1e56ztr\"><\/div>\n<p>Please be aware that the first day of your stay in Vietnam is counted as one full day, and the day you depart is also counted as one full day. Therefore, if you have a 45-day Vietnam Visa exemption, you are allowed to stay in Vietnam for up to 44 nights.<\/p>\n<div class=\"x1e56ztr\"><\/div>\n<p>For citizens of countries not on the Visa exemption list, you will need to obtain a Visa before traveling to Vietnam.Most travelers to Vietnam can get an E-Visa and the Visa is only valid for 90 days. If you want to stay in Vietnam for longer than 90 days, you need to apply for another E-visa, leave the country and then reenter.<\/p>\n<div><\/div>\n<p>For the E-Visa we would recommend that you apply for it at least 1 week before your travel date because it takes at least 3 business days to process. and it costs $25 USD.<\/p>\n<div class=\"x1e56ztr\"><\/div>\n<p>There is only one official site to get the E-visa:<\/p>\n<p><a href=\"https:\/\/evisa.xuatnhapcanh.gov.vn\/trang-chu-ttdt\">https:\/\/evisa.xuatnhapcanh.gov.vn\/trang-chu-ttdt<\/a><\/p>\n<p>So If you find any other site purporting to issue E-Visas, or any site with the word &#8216;E-Visa&#8217; in their domain name, be aware that they will be acting as a third party which means they will charge you an extra fee to get you to exact same visa you could get on your own.[\/vc_column_text][\/vc_accordion_tab][\/vc_accordion][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column][vc_column_text el_class=&#8221;page_title&#8221;] Ho Chi Minh City (Saigon) FAQ [\/vc_column_text][vc_separator el_width=&#8221;10&#8243;][\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text el_class=&#8221;margin_bottom_0&#8243;][\/vc_column_text][\/vc_column][\/vc_row][vc_row el_class=&#8221;max_width_1300 margin_left_auto margin_right_auto&#8221;][vc_column][vc_accordion active_tab=&#8221;false&#8221; collapsible=&#8221;yes&#8221; title_size=&#8221;h4&#8243; style=&#8221;3&#8243;][vc_accordion_tab title=&#8221;What does XO stand for?&#8221;][vc_column_text]X.O. is short for &#8220;xe om&#8221;, which are motorbike taxis in Vietnam. Our xe oms are very unique however because all our drivers are women who wear beautiful Vietnamese dresses and can speak&hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":""},"class_list":["post-296","page","type-page","status-publish","hentry","description-off"],"acf":[],"_links":{"self":[{"href":"https:\/\/xotours.vn\/wp-json\/wp\/v2\/pages\/296","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/xotours.vn\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/xotours.vn\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/xotours.vn\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/xotours.vn\/wp-json\/wp\/v2\/comments?post=296"}],"version-history":[{"count":184,"href":"https:\/\/xotours.vn\/wp-json\/wp\/v2\/pages\/296\/revisions"}],"predecessor-version":[{"id":4232,"href":"https:\/\/xotours.vn\/wp-json\/wp\/v2\/pages\/296\/revisions\/4232"}],"wp:attachment":[{"href":"https:\/\/xotours.vn\/wp-json\/wp\/v2\/media?parent=296"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}